export const SortCategoryData = [" الكل ", " شائع ", " مستحسن ", " المزيد "];
export const CategoryData = [
  {
    title: " القاهرة ",
    image: require("../../assets/cairo.jpg"),
  },
  {
    title: " القدس ",
    image: require("../../assets/alkods.jpg"),
  },

  {
    title: " دبي ",
    image: require("../../assets/دبي.jpg"),
  },
  {
    title: " إستانبول ",
    image: require("../../assets/استانبول.jpg"),
  },
  {
    title: " مكة المكرمة ",
    image: require("../../assets/مكة.webp"),
  },
  {
    title: " الدارالبيضاء ",
    image: require("../../assets/dar.jpg"),
  },
];

export const DestinationsData = [
  {
    name: "الدار البيضاء",
    image: require("../../assets/dar.jpg"),
    temperature: "25 درجة مئوية",
    timeFromCairo: " 3 ساعات ",
    distance: " 2,500 كيلومتر ",
    estimatedPrice: "$500",
    shortDescription:
      "الدار البيضاء هي أكبر مدينة في المغرب وتعتبر مركزًا اقتصاديًا رئيسيًا.",
    longDescription:
      "الدار البيضاء هي مدينة ساحلية تقع على ساحل المحيط الأطلسي في المغرب. تشتهر بمناظرها الخلابة وشواطئها الرملية الجميلة. تعد الدار البيضاء مركزًا مهمًا للأعمال والتجارة في المغرب، وتحتضن العديد من الشركات والمراكز التجارية الكبرى.",
  },
  {
    name: "مكة المكرمة",
    image: require("../../assets/مكة.webp"),
    temperature: " 35 درجة مئوية ",
    timeFromCairo: " 2 ساعات ",
    distance: " 1,000 كيلومتر ",
    estimatedPrice: "$300",
    shortDescription:
      "مكة المكرمة هي المدينة المقدسة في الإسلام وتستقبل الملايين من الحجاج كل عام.",
    longDescription:
      "مكة المكرمة هي المدينة المقدسة في الإسلام وتعتبر وجهة الحج والعمرة للمسلمين من جميع أنحاء العالم. تضم مكة المكرمة المسجد الحرام والكعبة المشرفة والتي يتوجه إليها المسلمون في صلاتهم اليومية وأثناء أداء الحج والعمرة.",
  },
  {
    name: "استانبول",
    image: require("../../assets/استانبول.jpg"),
    temperature: "30 درجة مئوية",
    timeFromCairo: " 2 ساعات ",
    distance: "1,200 كيلومتر",
    estimatedPrice: "$400",
    shortDescription:
      "استانبول هي واحدة من أجمل المدن في تركيا وتجمع بين الثقافات الشرقية والغربية.",
    longDescription:
      "استانبول هي مدينة فريدة من نوعها تقع على مضيق البوسفور في تركيا. تتميز بتاريخها العريق ومعالمها الثقافية المثيرة للإعجاب. تجتمع في استانبول العناصر الشرقية والغربية، وتضم مساجدها الجميلة والأسواق التقليدية والمتاحف والمطاعم العصرية.",
  },
  {
    name: "دبي",
    image: require("../../assets/دبي.jpg"),
    temperature: " 40 درجة مئوية ",
    timeFromCairo: " 3 ساعات ",
    distance: " 2,000 كيلومتر ",
    estimatedPrice: " $600 ",
    shortDescription:
      "دبي هي وجهة سياحية ومدينة مستقبلية حديثة تشتهر بالمباني الشاهقة والتسوق الفاخر.",
    longDescription:
      "دبي هي إمارة في الإمارات العربية المتحدة وتعد من أكثر الوجهات السياحية شهرة في العالم. تشتهر بأبراجها الشاهقة مثل برج خليفة وجزيرة النخلة الاصطناعية ومجمعات التسوق الفاخرة. تعتبر دبي واحدة من أهم المراكز التجارية والمالية في المنطقة.",
  },
  {
    name: "القدس",
    image: require("../../assets/alkods.jpg"),
    temperature: "28 درجة مئوية",
    timeFromCairo: " 1 ساعة ",
    distance: "500 كيلومتر",
    estimatedPrice: "$200",
    shortDescription:
      "القدس هي مدينة مقدسة للأديان الثلاثة السماوية وتحتضن الأماكن المقدسة لليهود والمسلمين والمسيحيين.",
    longDescription:
      "القدس هي مدينة مقدسة للأديان الثلاثة السماوية: اليهودية والإسلامية والمسيحية. تحتضن العديد من المواقع المقدسة مثل المسجد الأقصى والكنيسة القديسة البديلة والجدار الغربي. تعتبر القدس مركزًا للعبادة والتاريخ والثقافة في الشرق الأوسط.",
  },
  {
    name: "القاهرة",
    image: require("../../assets/cairo.jpg"),
    temperature: "32 درجة مئوية",
    timeFromCairo: " 0 ساعات ",
    distance: " 0 كيلومتر ",
    estimatedPrice: "$0",
    shortDescription:
      "القاهرة هي عاصمة مصر وتعد من أكبر المدن في أفريقيا والشرق الأوسط.",
    longDescription:
      "القاهرة هي عاصمة مصر وأكبر مدينة في البلاد. تحتضن العديد من المعالم السياحية مثل الأهرامات والمتحف المصري وسوق خان الخليلي. تعد القاهرة مركزًا حضريًا حديثًا مع تاريخ طويل يمتد لآلاف السنين.",
  },
];
